Revit 2026 API

# FamilyManagerSetFormula Method

---

Set the formula of a family parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFormula(
	FamilyParameter familyParameter,
	string formula
)
```
```vb
Public Sub SetFormula (
	familyParameter As FamilyParameter,
	formula As String
)
```
```cpp
public:
void SetFormula(
	FamilyParameter^ familyParameter,
	String^ formula
)
```
```fsharp
member SetFormula :
        familyParameter : FamilyParameter *
        formula : string -> unit
```

#### Parameters

familyParameter FamilyParameter
    The family parameter.
formula String
    The formula string, input  to clean the formula of the parameter.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| InvalidOperationException | Thrown when there is no valid family type, or the parameter cannot be assigned a formula, or the operation make a circular chain of references among the formulas. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace